In [4]:
import pandas as pd
df = pd.read_csv("sample_employee_data2.csv")

df.head()

    Employee ID   Name  Department   Salary YEARS_at_COMPANY   Bonus%
0          201.0  Luna       Sales  62000.0                 3    0.12
1          202.0  Noah       Sales      NaN               two    0.10
2          203.0  Zara          HR  58000.0                 4     NaN
3          204.0   Kai          IT  61000.0                 5    0.09
4          204.0   Kai          IT  61000.0                 5    0.09

In [12]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
df.columns

Index(['employee_id', 'name', 'department', 'salary', 'years_at_company',
       'bonus%'],
      dtype='object')

In [14]:
df.isnull().sum()

employee_id         1
name                0
department          0
salary              1
years_at_company    1
bonus%              1
dtype: int64

In [20]:
df['salary'].fillna(df['salary'].mean())

0    62000.000000
1    59666.666667
2    58000.000000
3    61000.000000
4    61000.000000
5    57000.000000
6    59000.000000
Name: salary, dtype: float64

In [22]:
df['salary'].describe()

count        7.000000
mean     59666.666667
std       1795.054936
min      57000.000000
25%      58500.000000
50%      59666.666667
75%      61000.000000
max      62000.000000
Name: salary, dtype: float64

In [30]:
df['bonus%'] = df['bonus%'].fillna(df['bonus%'].mean())
df['bonus%']

0    0.120000
1    0.100000
2    0.098333
3    0.090000
4    0.090000
5    0.110000
6    0.080000
Name: bonus%, dtype: float64

In [40]:
df.dropna(subset = ['employee_id'], inplace=True)

In [48]:
df['years_at_company'] = pd.to_numeric(df['years_at_company'], errors='coerce')

In [58]:
df['years_at_company'] = df['years_at_company'].fillna(df['years_at_company'].mean())

In [62]:
df.isnull().sum()

employee_id         0
name                0
department          0
salary              0
years_at_company    0
bonus%              0
dtype: int64

In [64]:
df.drop_duplicates(inplace=True)

In [66]:
df.shape

(5, 6)

In [68]:
df.to_csv("cleaned_employee_data.csv", index=False)